Tekla Open API Reference for Tekla Structures 2025
InputItem Class
 The InputItem class is used to store input objects and positions.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Model.InputItem
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class InputItem
<SerializableAttribute>
Public NotInheritable Class InputItem
The InputItem type exposes the following members.
Methods
Name | Description
GetData
 Returns the data of the input item. See also: InputItem.InputTypeEnum.
GetInputType
 Returns the type of the input item.
Top
See Also
Reference
Tekla.Structures.Model Namespace